XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/FMD.FT32F0xx_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.0" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>FMD</vendor>
  <url>https://www.fremontmicro.com/upload/tools/pack/</url>
  <name>FT32F0xx_DFP</name>
  <description>FremontMicro FT32F0 Series Device Support and Examples</description>
  
  <releases>
    <release version="1.1.0" date="2024-01-19">
	  Release Note:
	  Device support:
	  - Deleted FT32F072KBDWx	  
    </release>
    <release version="1.0.9" date="2023-11-02">
	  Release Note:
	  Device support:
	  - Added: Devices FT32F072CBBTx
	  - Added: Devices FT32F030F8APx
	  - Added: Devices FT32F032G8CSx
	  - Added: Devices FT32F030RBATx 
	  - Modify FT32F032G8B -> FT32F032G8BSx
	  - Modify FT32F032K8B -> FT32F032K8BUx
	  Examples:
      - Updated PWR_Stop_WAKUP_COMP \ PWR_Stop_WAKUP_EX_INTERRUPT
      - Updated USB_VCP
      - Updated RTC ALARM STOP WAKE
	  - Added PWR_Stop_MIN_SYS
    </release>
    <release version="1.0.8" date="2022-09-06">
	  - Added: example of IAR.
    </release>
    <release version="1.0.7" date="2022-08-26">
	Release Note:
	  Device support:
	  - Added: Devices FT32F030KBCU7 FT32F072KBCW7 FT32F072KBDW7
	  - Deleted: Devices FT32F072KBCU7
	  - Added: FT32F0xB.svd
	  - Added: ft32f030xb.h ft32f072x6.h
	  Driver:
	  - Updated Comp flash file.
	  - Updated Examples.
	  - Deleted component of touch.
	  - Deleted example of touch.
    </release>
    <release version="1.0.6" date="2022-05-17">
      Device support:
      - Added: Devices FT32F072K6BT7, FT32F072KBBT7, FT32F072KBBU7, FT32F072KBCU7
      - Added: Devices FT32F030CBAT7, FT32F030K8A
      Driver:
      - Updated Power Timer Driver file.
      - Updated ft32f0xx_conf.h file.
    </release>
    <release version="1.0.5" date="2022-01-24">
	  - Modify DIV COMP OPA ADC DIV Driver files.
	  - Modify Starter-kit-072 board doc.
	  - Added: Examples.
    </release>
    <release version="1.0.4" date="2022-01-21">
	  - Modify the system clock configuration
	  - Added: Devices FT32F032K8B, FT32F032G8B.
      - Added: FT32F032x8.h files.	
	  - Added: Devices FT32F072RBATx, FT32F072CBAT7.
      - Added: DIV Driver files.
      - Updated: documentation.
    </release>
    <release version="1.0.2" date="2021-10-22">
      - Added: Touch library. Demo is also included.
      - Added: Starter-kit-072 board description and examples.
      - Updated: documentation.
    </release>
    <release version="1.0.1" date="2021-08-03">
      - Updated FT32Driver files.
    </release>
    <release version="1.0.0" date="2021-07-14">
      - First Release version of FT32F0 Device Family Pack.
    </release>
  </releases>
  
  <keywords>
    <!-- keywords for indexing -->
    <keyword>FMD</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package FremontMicro</keyword>
    <keyword>FT32F0</keyword>
    <keyword>FT32</keyword>
  </keywords>
  
  <devices>
    <family Dfamily="FT32F0 Series" Dvendor="FMD:169">
      <processor Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
      <book    name="Documentation/dui0497a_cortex_m0_r0p0_generic_ug.pdf" title="Cortex-M0 Generic User Guide"/>
      	<description>
        FT32 is a 32-bit high performance, low power consumption universal microcontroller family powered by the ARM Cortex-M0 RISC core,which targeted at various MCU application areas.FT32 family integrates high speed memory and powerful enhanced I/O.

  Frequency up to 96MHZ
  Single-cycle hardware multiplier
  NVIC with 32 interrupt vectors, 2 watchpoint and 4 priority levels
  SWD debug interface, 4 hardware breakpoints
  7 Timers: 
  - One 16-bit advanced-control timer , 
  - Five 16-bit general purpose timers, 
  - One 16-bit basic timer
        </description> 
      
       <!-- ************************  Subfamily 'FT32F030'  **************************** -->
      <subFamily DsubFamily="FT32F030">
        <processor Dclock="72000000"/>
        <compile header="Drivers/CMSIS/FT32F0xx/Include/ft32f0xx.h"/>
        <debug svd="CMSIS/SVD/FT32F0xx.svd"/>

        <debugvars configfile="CMSIS/Debug/FT32F030_070.dbgconf">
          __var DbgMCU_CR      = 0x00000006;   // DBGMCU_CR:  DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz = 0x00000000;   // DGBMCU_APB1_FZ: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
          __var DoOptionByteLoading = 0;       // Disabled
        </debugvars>

        <book name="Documentation/FT32F0xx_RM_rev0.9.pdf" title="FT32F0xx Reference Manual"/>
        <book name="Documentation/FT32F030xx_32F032xx_DS_rev1p05.pdf" title="FT32F03xxx Data Sheet"/>

        <feature type="WDT"           n="2"/>
        <feature type="RTC"           n="32768"/>
        <feature type="Timer"         n="7"       m="16"/>
        <feature type="Temp"          n="-40"     m="105"/>
        <feature type="VCC"           n="2.50"    m="5.50"/>
        <!-- *************************  Device 'FT32F030R8'  ***************************** -->
        <device Dname="FT32F030R8">
          <compile define="FT32F030x8"/>
          <memory id="IROM1"                              start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/FT32F0xx_64.FLM"   start="0x08000000" size="0x00010000"             default="1"/>

		  <feature type="ADC"           n="16"       m="12"/>
          <feature type="IOs"           n="55"/>
          <feature type="SPI"           n="2"       m="18000000"/>
          <feature type="I2C"           n="2"/>
          <feature type="USART"         n="2"       m="9000000"/>
          <variant Dvariant="FT32F030R8ATx">
            <feature type="LQFP" n="64"/>
          </variant>
        </device>
        <!-- *************************  Device 'FT32F030C8'  ***************************** -->
        <device Dname="FT32F030C8">
          <compile define="FT32F030x8"/>
          <memory id="IROM1"                              start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/FT32F0xx_64.FLM"  start="0x08000000" size="0x00010000"             default="1"/>

		  <feature type="ADC"           n="10"       m="12"/>
          <feature type="IOs"           n="39"/>
          <feature type="SPI"           n="2"       m="18000000"/>
          <feature type="I2C"           n="2"/>
          <feature type="USART"         n="2"       m="9000000"/>
          <variant Dvariant="FT32F030C8ATx">
            <feature type="LQFP" n="48"/>
          </variant>
        </device>
        <!-- *************************  Device 'FT32F030G8'  ***************************** -->
        <device Dname="FT32F030G8">
          <compile define="FT32F030x8"/>
          <memory id="IROM1"                              start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/FT32F0xx_64.FLM"  start="0x08000000" size="0x00010000"             default="1"/>

		  <feature type="ADC"           n="10"       m="12"/>
          <feature type="IOs"           n="23"/>
          <feature type="SPI"           n="2"       m="18000000"/>
          <feature type="I2C"           n="2"/>
          <feature type="USART"         n="2"       m="9000000"/>
          <variant Dvariant="FT32F030G8BUx">
            <feature type="QFN" n="28"/>
          </variant>
        </device>
        <!-- *************************  Device 'FT32F030K6'  ***************************** -->
        <device Dname="FT32F030K6">
          <compile define="FT32F030x6"/>
          <memory id="IROM1"                              start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/FT32F0xx_32.FLM"   start="0x08000000" size="0x00008000"             default="1"/>

		  <feature type="ADC"           n="10"       m="12"/>
          <feature type="IOs"           n="25"/>
          <feature type="SPI"           n="1"       m="18000000"/>
          <feature type="I2C"           n="1"/>
          <feature type="USART"         n="1"       m="9000000"/>
          <variant Dvariant="FT32F030K6ATx">
            <feature type="LQFP" n="32"/>
          </variant>
        </device>
        <!-- *************************  Device 'FT32F030F6'  ***************************** -->
        <device Dname="FT32F030F6">
          <compile define="FT32F030x6"/>
          <memory id="IROM1"                              start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/FT32F0xx_32.FLM"   start="0x08000000" size="0x00008000"             default="1"/>

		  <feature type="ADC"           n="9"       m="12"/>
          <feature type="SPI"           n="1"       m="18000000"/>
          <feature type="I2C"           n="1"/>
          <feature type="USART"         n="1"       m="9000000"/>
          <variant Dvariant="FT32F030F6APx">
            <feature type="IOs"           n="15"/>
            <feature type="TSSOP"         n="20"/>
          </variant>
          <variant Dvariant="FT32F030F6CUx">
            <feature type="IOs"           n="16"/>
            <feature type="QFN"           n="20"/>
          </variant>
        </device>
