XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/FMD.FT32F0xx_DFP.pdsc
        <!-- *************************  Device 'FT32F030K8'  ***************************** -->
        <device Dname="FT32F030K8">
          <compile define="FT32F030x8"/>
          <memory id="IROM1"                              start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/FT32F0xx_64.FLM"  start="0x08000000" size="0x00010000"             default="1"/>

		  <feature type="ADC"           n="10"       m="12"/>
          <feature type="USART"         n="2"       m="9000000"/>
          <variant Dvariant="FT32F030K8BUx">
            <feature type="SPI"           n="1"       m="18000000"/>
            <feature type="I2C"           n="1"/>
            <feature type="IOs"           n="28"/>
            <feature type="QFN" n="32"/>
          </variant>
          <variant Dvariant="FT32F030K8ATx">
            <feature type="SPI"           n="2"       m="18000000"/>
            <feature type="I2C"           n="2"/>
            <feature type="IOs"           n="25"/>
            <feature type="LQFP" n="32"/>
          </variant>
        </device>
		<!-- *************************  Device 'FT32F030CB'  ***************************** -->
        <device Dname="FT32F030CB">
		  <processor Dclock="96000000"/>
          <compile define="FT32F030xB"/>
          <debug svd="CMSIS/SVD/FT32F0xB.svd"/>
          <memory id="IROM1"                              start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00006000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/FT32F0xx_128.FLM"  start="0x08000000" size="0x00020000"             default="1"/>

		  <feature type="ADC"           n="10"      m="12"/>
          <feature type="DAC"           n="2"       m="7"/>
          <feature type="USART"         n="2"       m="9000000"/>
          <feature type="SPI"           n="2"       m="18000000"/>
          <feature type="I2C"           n="2"/>
          <feature type="IOs"           n="39"/>
          <variant Dvariant="FT32F030CBATx">
            <feature type="LQFP48" n="48"/>
          </variant>
        </device>
		<!-- *************************  Device 'FT32F030KB'  ***************************** -->
        <device Dname="FT32F030KB">
		  <processor Dclock="96000000"/>
          <compile define="FT32F030xB"/>
          <debug svd="CMSIS/SVD/FT32F0xB.svd"/>
          <memory id="IROM1"                              start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00006000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/FT32F0xx_128.FLM"  start="0x08000000" size="0x00020000"             default="1"/>

		  <feature type="ADC"           n="10"      m="12"/>
          <feature type="DAC"           n="2"       m="7"/>
          <feature type="USART"         n="1"       m="9000000"/>
          <feature type="SPI"           n="1"       m="18000000"/>
          <feature type="I2C"           n="1"/>
          <feature type="IOs"           n="25"/>
          <variant Dvariant="FT32F030KBCUx">
            <feature type="QFN" n="32"/>
          </variant>
        </device>
        <!-- *************************  Device 'FT32F030F8'  ***************************** -->
        <device Dname="FT32F030F8">
          <compile define="FT32F030x8"/>
          <memory id="IROM1"                              start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/FT32F0xx_64.FLM"  start="0x08000000" size="0x00010000"             default="1"/>

		  <feature type="ADC"           n="9"       m="12"/>
          <feature type="IOs"           n="15"/>
          <feature type="SPI"           n="2"       m="18000000"/>
          <feature type="I2C"           n="1"/>
          <feature type="USART"         n="2"       m="9000000"/>
          <variant Dvariant="FT32F030F8APx">
            <feature type="TSSOP" n="20"/>
          </variant>
        </device>
		<!-- *************************  Device 'FT32F030RB'  ***************************** -->
        <device Dname="FT32F030RB">
		  <processor Dclock="96000000"/>
          <compile define="FT32F030xB"/>
          <debug svd="CMSIS/SVD/FT32F0xB.svd"/>
          <memory id="IROM1"                              start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00006000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/FT32F0xx_128.FLM"  start="0x08000000" size="0x00020000"             default="1"/>

		  <feature type="ADC"           n="16"      m="12"/>
          <feature type="DAC"           n="2"       m="7"/>
          <feature type="USART"         n="2"       m="9000000"/>
          <feature type="SPI"           n="2"       m="18000000"/>
          <feature type="I2C"           n="2"/>
          <feature type="IOs"           n="55"/>
          <variant Dvariant="FT32F030RBATx">
            <feature type="LQFP64" n="64"/>
          </variant>
        </device>
      </subFamily> 
       <!-- ************************  Subfamily 'FT32F032'  **************************** -->
      <subFamily DsubFamily="FT32F032">
        <processor Dclock="72000000"/>
        <compile header="Drivers/CMSIS/FT32F0xx/Include/ft32f0xx.h"/>
        <debug svd="CMSIS/SVD/FT32F0xx.svd"/>

        <debugvars configfile="CMSIS/Debug/FT32F030_070.dbgconf">
          __var DbgMCU_CR      = 0x00000006;   // DBGMCU_CR:  DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz = 0x00000000;   // DGBMCU_APB1_FZ: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
          __var DoOptionByteLoading = 0;       // Disabled
        </debugvars>

        <book name="Documentation/FT32F0xx_RM_rev0.9.pdf" title="FT32F0xx Reference Manual"/>
        <book name="Documentation/FT32F030xx_32F032xx_DS_rev1p05.pdf" title="FT32F03xxx Data Sheet"/>

        <feature type="WDT"           n="2"/>
        <feature type="RTC"           n="32768"/>
        <feature type="DAC"           n="2"       m="7"/>
        <feature type="Timer"         n="7"       m="16"/>
        <feature type="Temp"          n="-40"     m="105"/>
        <feature type="VCC"           n="2.50"    m="5.50"/>
		<!-- *************************  Device 'FT32F032G8'  ***************************** -->
        <device Dname="FT32F032G8">
          <compile define="FT32F032x8"/>
          <memory id="IROM1"                              start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/FT32F0xx_64.FLM"  start="0x08000000" size="0x00010000"             default="1"/>

		  <feature type="ADC"           n="10"       m="12"/>
          <feature type="SPI"           n="2"       m="18000000"/>
          <feature type="I2C"           n="1"/>
          <feature type="USART"         n="2"       m="9000000"/>
		  
          <variant Dvariant="FT32F032G8BSx">
			<feature type="Touch"         n="21"/>
			<feature type="IOs"           n="26"/>
            <feature type="SOP" n="28"/>
          </variant>
          <variant Dvariant="FT32F032G8CSx">
			<feature type="Touch"         n="24"/>
			<feature type="IOs"           n="27"/>
            <feature type="SOP" n="28"/>
          </variant>
        </device>
		
		<!-- *************************  Device 'FT32F032K8'  ***************************** -->
        <device Dname="FT32F032K8">
          <compile define="FT32F032x8"/>
          <memory id="IROM1"                              start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/FT32F0xx_64.FLM"  start="0x08000000" size="0x00010000"             default="1"/>

		  <feature type="ADC"           n="10"       m="12"/>
		  <feature type="Touch"         n="18"/>
          <feature type="IOs"           n="28"/>
          <feature type="SPI"           n="1"       m="18000000"/>
          <feature type="I2C"           n="1"/>
          <feature type="USART"         n="2"       m="9000000"/>
          <variant Dvariant="FT32F032K8BUx">
            <feature type="QFN" n="32"/>
          </variant>
        </device>
      </subFamily>
       <!-- ************************  Subfamily 'FT32F072'  **************************** -->
      <subFamily DsubFamily="FT32F072">
		<processor Dclock="96000000"/>
        <compile header="Drivers/CMSIS/FT32F0xx/Include/ft32f0xx.h"/>
        <debug svd="CMSIS/SVD/FT32F0xx.svd"/>
        
        <debugvars configfile="CMSIS/Debug/FT32F030_070.dbgconf">
          __var DbgMCU_CR      = 0x00000006;   // DBGMCU_CR:  DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz = 0x00000000;   // DGBMCU_APB1_FZ: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
          __var DoOptionByteLoading = 0;       // Disabled
        </debugvars>

        <book name="Documentation/FT32F0xx_RM_rev0.9.pdf" title="FT32F0xx Reference Manual"/>
        <book name="Documentation/FT32F0xxB_RM_preliminary_rev0p81.pdf" title="FT32F0xxB Reference Manual"/>
        <book name="Documentation/FT32F072xx_DS_rev1p03.pdf" title="FT32F072xx Data Sheet"/>
        <book name="Documentation/FT32F072xB_DS_preliminary_rev0p51.pdf" title="FT32F072xB Data Sheet"/>

        <feature type="WDT"           n="2"/>
        <feature type="RTC"           n="32768"/>
        <feature type="DAC"           n="2"       m="7"/>
        <feature type="Temp"          n="-40"     m="105"/>
        <feature type="VCC"           n="2.00"    m="5.50"/>
        <feature type="Timer"         n="7"       m="16"/>
        <feature type="SPI"           n="2"       m="18000000"/>
        <feature type="I2C"           n="2"/>
        <feature type="USART"         n="2"/>
        <feature type="USB2.0"        n="1"/>
        <!-- *************************  Device 'FT32F072R8'  ***************************** -->
        <device Dname="FT32F072R8">
          <processor Dclock="72000000"/>
          <compile define="FT32F072x8"/>
          <memory id="IROM1"                              start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/FT32F0xx_64.FLM"   start="0x08000000" size="0x00010000"             default="1"/>

          <feature type="ADC"           n="16"      m="12"/>
		  <feature type="Touch"         n="24"/>
          <!--feature type="IOs"           n="55"/-->
          <variant Dvariant="FT32F072R8ATx">
          <feature type="IOs"           n="51"/>
            <feature type="LQFP"        n="64"/>
          </variant>
          <variant Dvariant="FT32F072R8BTx">
          <feature type="IOs"           n="55"/>
            <feature type="LQFP"        n="64"/>
          </variant>
        </device>
        <!-- *************************  Device 'FT32F072C8'  ***************************** -->       
		 <device Dname="FT32F072C8">
          <processor Dclock="72000000"/>
          <compile define="FT32F072x8"/>
          <memory id="IROM1"                              start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/FT32F0xx_64.FLM"   start="0x08000000" size="0x00010000"             default="1"/>

          <feature type="ADC"           n="10"      m="12"/>
		  <feature type="Touch"         n="24"/>
          <variant Dvariant="FT32F072C8ATx">
			<feature type="IOs"         n="37"/>
            <feature type="LQFP" 		n="48"/>
          </variant>
          <variant Dvariant="FT32F072C8BTx">
			<feature type="IOs"         n="39"/>
            <feature type="LQFP" 		n="48"/>
          </variant>
        </device>
		<!-- *************************  Device 'FT32F072K6'  ***************************** -->       
		 <device Dname="FT32F072K6">
          <processor Dclock="72000000"/>
          <compile define="FT32F072x6"/>
          <memory id="IROM1"                              start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/FT32F0xx_32.FLM"   start="0x08000000" size="0x00008000"             default="1"/>

          <feature type="ADC"           n="10"      m="12"/>
		  <feature type="Touch"         n="17"/>
          <feature type="IOs"           n="26"/>
          <feature type="SPI"           n="2"       m="18000000"/>
          <feature type="I2C"           n="2"/>
          <variant Dvariant="FT32F072K6BTx">
            <feature type="LQFP" n="32"/>
          </variant>
        </device>
        <!-- *************************  Device 'FT32F072RB'  ***************************** -->       
		 <device Dname="FT32F072RB">
          <compile define="FT32F072xB"/>
          <debug svd="CMSIS/SVD/FT32F0xB.svd"/>
          <memory id="IROM1"                              start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00006000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/FT32F0xx_128.FLM"  start="0x08000000" size="0x00020000"             default="1"/>

          <feature type="ADC"           n="16"      m="12"/>
		  <feature type="Touch"         n="24"/>
          <feature type="IOs"           n="51"/>
          <variant Dvariant="FT32F072RBATx">
            <feature type="LQFP" n="64"/>
          </variant>
        </device>
