XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/FMD.FT32F0xx_DFP.pdsc
        <!-- *************************  Device 'FT32F072CB'  ***************************** -->       
		 <device Dname="FT32F072CB">
          <compile define="FT32F072xB"/>
          <debug svd="CMSIS/SVD/FT32F0xB.svd"/>
          <memory id="IROM1"                              start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00006000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/FT32F0xx_128.FLM"   start="0x08000000" size="0x00020000"             default="1"/>

          <variant Dvariant="FT32F072CBATx">
			<feature type="ADC"           n="10"      m="12"/>
			<feature type="Touch"         n="24"/>
			<feature type="IOs"           n="37"/>
            <feature type="LQFP" n="48"/>
          </variant>
          <variant Dvariant="FT32F072CBBTx">
			<feature type="ADC"           n="16"      m="12"/>
			<feature type="Touch"         n="19"/>
			<feature type="IOs"           n="42"/>
            <feature type="LQFP" n="48"/>
          </variant>
        </device>
		<!-- *************************  Device 'FT32F072KB'  ***************************** -->       
		 <device Dname="FT32F072KB">
          <compile define="FT32F072xB"/>
          <debug svd="CMSIS/SVD/FT32F0xB.svd"/>
          <memory id="IROM1"                              start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00006000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/FT32F0xx_128.FLM"   start="0x08000000" size="0x00020000"             default="1"/>

          <feature type="ADC"           n="10"      m="12"/>
		  <feature type="Touch"         n="24"/>
          <variant Dvariant="FT32F072KBBTx">
			<feature type="IOs"         n="25"/>
            <feature type="LQFP" 		n="32"/>
          </variant>
          <variant Dvariant="FT32F072KBBUx">
			<feature type="IOs"         n="25"/>
            <feature type="QFN" n="32"/>
          </variant>
          <variant Dvariant="FT32F072KBCWx">
			<feature type="IOs"         n="25"/>
            <feature type="QFN" n="32"/>
          </variant>          
        </device> 		
      </subFamily>
    </family>
  </devices>
  
  <conditions>
	<!-- Compiler Conditions -->
	<condition id="Compiler ARMCC">
	    <require Tcompiler="ARMCC"/>
	  </condition>
	
	<!-- Device Conditions --> 
    <condition id="FT32F0">
      <description>FremontMicro FT32F0 Series Devices</description>
      <require Dvendor="FMD:169"  Dname="FT32F0*"/>
    </condition> 
    <condition id="FT32F0x2">
      <description>FremontMicro FT32F0x2 Series Devices</description>
      <require Dvendor="FMD:169"  Dname="FT32F0?2*"/>
    </condition> 
    <condition id="FT32F030x6">
      <description>FremontMicro FT32F030x6 Devices</description>
      <require Dvendor="FMD:169"  Dname="FT32F030?6*"/>
    </condition>
    <condition id="FT32F030x8">
      <description>FremontMicro FT32F030x8 Devices</description>
      <require Dvendor="FMD:169"  Dname="FT32F030?8*"/>
    </condition>
    <condition id="FT32F030xB">
      <description>FremontMicro FT32F030xB Devices</description>
      <require Dvendor="FMD:169"  Dname="FT32F030?B*"/>
    </condition>
    <condition id="FT32F032x8">
      <description>FremontMicro FT32F032x8 Devices</description>
      <require Dvendor="FMD:169"  Dname="FT32F032?8*"/>
    </condition>
    <condition id="FT32F072x6">
      <description>FremontMicro FT32F072x6 Devices</description>
      <require Dvendor="FMD:169"  Dname="FT32F072?6*"/>
    </condition>
    <condition id="FT32F072x8">
      <description>FremontMicro FT32F072x8 Devices</description>
      <require Dvendor="FMD:169"  Dname="FT32F072?8*"/>
    </condition>
    <condition id="FT32F072xB">
      <description>FremontMicro FT32F072xB Devices</description>
      <require Dvendor="FMD:169"  Dname="FT32F072?B*"/>
    </condition>
	
    
    <condition id="FT32F0xxxB">
      <description>FremontMicro FT32F072xB FT32F032xB FT32F030xB Devices</description>
      <accept condition="FT32F0x2"/>
      <accept condition="FT32F030xB"/>
    </condition>
	
	<!-- Device + CMSIS Conditions -->
    <condition id="FT32F0 CMSIS">
      <description>FremontMicro FT32F0 Series Device and CMSIS-Core</description>
      <require condition="FT32F0"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
    </condition>
 
    <!-- Device + Compiler Conditions -->
    <condition id="FT32F0 ARMCC">
      <description>FremontMicro FT32F0 Devices and ARMCC Compiler</description>
      <require condition="FT32F0"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="FT32F030x6 ARMCC">
      <description>FremontMicro FT32F030x6 Devices and ARMCC Compiler</description>
      <require condition="FT32F030x6"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="FT32F030x8 ARMCC">
      <description>FremontMicro FT32F030x8 Devices and ARMCC Compiler</description>
      <require condition="FT32F030x8"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="FT32F030xB ARMCC">
      <description>FremontMicro FT32F030xB Devices and ARMCC Compiler</description>
      <require condition="FT32F030xB"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="FT32F032x8 ARMCC">
      <description>FremontMicro FT32F032x8 Devices and ARMCC Compiler</description>
      <require condition="FT32F032x8"/>
      <require condition="Compiler ARMCC"/>
    </condition>
	<condition id="FT32F072x6 ARMCC">
      <description>FremontMicro FT32F072x6 Devices and ARMCC Compiler</description>
      <require condition="FT32F072x6"/>
      <require condition="Compiler ARMCC"/>
    </condition>
	<condition id="FT32F072x8 ARMCC">
      <description>FremontMicro FT32F072x8 Devices and ARMCC Compiler</description>
      <require condition="FT32F072x8"/>
      <require condition="Compiler ARMCC"/>
    </condition>
