XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/FMD.FT32F0xx_DFP.pdsc
	<condition id="FT32F072xB ARMCC">
      <description>FremontMicro FT32F072xB Devices and ARMCC Compiler</description>
      <require condition="FT32F072xB"/>
      <require condition="Compiler ARMCC"/>
    </condition>
 
    <condition id="FT32F0 STARTUP CORTEX GPIO RCC FLASH">
      <description>FremontMicro FT32F0 devices, Startup and CORTEX, GPIO, RCC and FLASH</description>
      <require condition="FT32F0"/>
      <require Cbundle="StdDriverOne" Cclass="Device" Cgroup="Startup"/>
      <require Cbundle="StdDriverOne" Cclass="Device" Cgroup="FT32Driver" Csub="GPIO"/>
      <require Cbundle="StdDriverOne" Cclass="Device" Cgroup="FT32Driver" Csub="RCC"/>
      <require Cbundle="StdDriverOne" Cclass="Device" Cgroup="FT32Driver" Csub="FLASH"/>
    </condition>
	<!-- Device Drivers Conditions -->	
    <condition id="FT32F0 STDDRIVER ALL">
      <description>FremontMicro FT32F0 Series Device, CMSIS-Core and Drivers</description>
      <require condition="FT32F0"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cbundle="StdDriverOne" Cclass="Device" Cgroup="Startup"/>
      <require Cbundle="StdDriver" Cclass="Device" Cgroup="FT32StdDriver"/>
    </condition>
    <condition id="FT32F0 STDDRIVER">
      <description>FremontMicro FT32F0 devices with Drivers </description>
      <require condition="FT32F0"/>
      <require Cbundle="StdDriverOne" Cclass="Device" Cgroup="FT32Driver" Csub="COMMON"/>
    </condition>
	
    <condition id="FT32F0xxxB STDDRIVER">
      <description>FremontMicro FT32F0xxxB devices with Drivers </description>
      <require condition="FT32F0xxxB"/>
      <require Cbundle="StdDriverOne" Cclass="Device" Cgroup="FT32Driver" Csub="COMMON"/>
    </condition>

    <condition id="FT32F0 STDDRIVER DMA">
      <description>FremontMicro FT32F0 Devices, Drivers, and DMA peripheral</description>
      <require condition="FT32F0 STDDRIVER"/>
      <require Cbundle="StdDriverOne" Cclass="Device" Cgroup="FT32Driver" Csub="DMA"/>
    </condition>
	
    <condition id="FT32F072x8 CMSIS">
      <description>FremontMicro FT32F072x8 Series Device and CMSIS-Core</description>
      <require condition="FT32F072x8"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
    </condition>
	
    <condition id="FT32F072xB STDDRIVER">
      <description>FremontMicro FT32F0 devices with Drivers </description>
      <require condition="FT32F072xB ARMCC"/>
      <require Cbundle="StdDriverOne" Cclass="Device" Cgroup="FT32Driver" Csub="COMMON"/>
    </condition>
  </conditions>
       
  <components>  
    <bundle Cbundle="StdDriverOne" Cclass="Device" isDefaultVariant="true"  Cversion="1.0.1">
      <description>All peripheral APIs are selectable as individual components.</description>
      <doc></doc>
	  
      <component Cgroup="Startup"  Cversion="1.0.1"     condition="FT32F0 CMSIS">
        <description>System Startup for FremontMicro</description>
        <RTE_Components_h>
          #define RTE_DEVICE_STARTUP_FT32F0XX    /* Device Startup for FT32F0 */
        </RTE_Components_h>
        <files>
          <!--  include folder -->
          <file category="include" name="Drivers/FT32F0xx_Driver/Inc/"/>
          <file category="include" name="Drivers/CMSIS/FT32F0xx/Include/"/>		  
          <file category="header" name="Drivers/CMSIS/FT32F0xx/Include/ft32f0xx.h"/>  
          <!-- startup files -->
          <!-- ARM Compiler Toolchain -->
          <file category="source" condition="FT32F030x6 ARMCC"  name="Drivers/CMSIS/FT32F0xx/source/arm/startup_ft32f030x6.s" attr="config" version="1.0.0"/>
          <file category="source" condition="FT32F030x8 ARMCC"  name="Drivers/CMSIS/FT32F0xx/source/arm/startup_ft32f030x8.s" attr="config" version="1.0.0"/>
		  <file category="source" condition="FT32F030xB ARMCC"  name="Drivers/CMSIS/FT32F0xx/source/arm/startup_ft32f072xb.s" attr="config" version="1.0.0"/>
          <file category="source" condition="FT32F032x8 ARMCC"  name="Drivers/CMSIS/FT32F0xx/source/arm/startup_ft32f030x8.s" attr="config" version="1.0.0"/>
		  <file category="source" condition="FT32F072x6 ARMCC"  name="Drivers/CMSIS/FT32F0xx/source/arm/startup_ft32f072xb.s" attr="config" version="1.0.0"/>
          <file category="source" condition="FT32F072x8 ARMCC"  name="Drivers/CMSIS/FT32F0xx/source/arm/startup_ft32f072xb.s" attr="config" version="1.0.0"/>
          <file category="source" condition="FT32F072xB ARMCC"  name="Drivers/CMSIS/FT32F0xx/source/arm/startup_ft32f072xb.s" attr="config" version="1.0.0"/>
          <!-- system file -->
          <file category="source" name="Drivers/CMSIS/FT32F0xx/source/system_ft32f0xx.c" attr="config" version="1.0.0"/>  
        </files>
      </component>
      <!-- FT32F0xx Drivers --> 
	  <component Cgroup="FT32Driver"  Csub="COMMON"     condition="FT32F0 STARTUP CORTEX GPIO RCC FLASH">
        <description>Common driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_COMMON
        </RTE_Components_h>
        <files>
          <file category="header" name="Drivers/FT32F0xx_Driver/templates/Inc/ft32f0xx_conf.h"     attr="config"  version="1.0.0"/>
          <file category="header" name="Drivers/FT32F0xx_Driver/templates/Inc/ft32f0xx_it.h"       attr="template" select="Exception Handlers and Peripheral IRQ"/>
          <file category="source" name="Drivers/FT32F0xx_Driver/templates/Src/ft32f0xx_it.c"       attr="template" select="Exception Handlers and Peripheral IRQ"/>
          <file category="header" name="Drivers/FT32F0xx_Driver/templates/Inc/main.h"              attr="template" select="'main' module"/>
          <file category="source" name="Drivers/FT32F0xx_Driver/templates/Src/main.c"              attr="template" select="'main' module"/>
        </files>
      </component>
      <component Cgroup="FT32Driver"  Csub="ADC"        condition="FT32F0 STDDRIVER">
        <description>Analog-to-digital converter (ADC) driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_ADC
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/FT32F0xx_Driver/Src/ft32f0xx_adc.c"/>
        </files>
      </component>
      <component Cgroup="FT32Driver"  Csub="COMP"       condition="FT32F0xxxB STDDRIVER">
        <description>Analog Comparator (COMP) driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_COMP
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/FT32F0xx_Driver/Src/ft32f0xx_comp.c"/>
        </files>
      </component>
      <component Cgroup="FT32Driver"  Csub="CRC"        condition="FT32F0 STDDRIVER">
        <description>CRC calculation unit (CRC) driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_CRC
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/FT32F0xx_Driver/Src/ft32f0xx_crc.c"/>
        </files>
      </component>
      <component Cgroup="FT32Driver"  Csub="CRS"        condition="FT32F0 STDDRIVER">
        <description>Clock recovery system (CRS) driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_CRS
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/FT32F0xx_Driver/Src/ft32f0xx_crs.c"/>
        </files>
      </component>
      <component Cgroup="FT32Driver"  Csub="DAC"        condition="FT32F0 STDDRIVER DMA">
        <description>Digital-to-analog converter (DAC) driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_DAC
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/FT32F0xx_Driver/Src/ft32f0xx_dac.c"/>
        </files>
      </component>
      <component Cgroup="FT32Driver"  Csub="DMA"        condition="FT32F0 STDDRIVER">
        <description>DMA controller (DMA) driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_DMA
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/FT32F0xx_Driver/Src/ft32f0xx_dma.c"/>
        </files>
      </component>
      <component Cgroup="FT32Driver"  Csub="DEBUG"      condition="FT32F0 STDDRIVER">
        <description>Debug MCU (DEBUG) driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_DBGMCU
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/FT32F0xx_Driver/Src/ft32f0xx_debug.c"/>
        </files>
      </component>
