XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/FMD.FT32F0xx_DFP.pdsc
      <component Cgroup="FT32Driver"  Csub="EXTI"       condition="FT32F0 STDDRIVER">
        <description>External interrupts and events (EXTI) controller</description>
        <RTE_Components_h>
          #define RTE_DEVICE_EXTI
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/FT32F0xx_Driver/Src/ft32f0xx_exti.c"/>
        </files>
      </component>
      <component Cgroup="FT32Driver"  Csub="FLASH"      condition="FT32F0 STDDRIVER">
        <description>Embedded Flash memory driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_FLASH
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/FT32F0xx_Driver/Src/ft32f0xx_flash.c"/>
        </files>
      </component>
      <component Cgroup="FT32Driver"  Csub="GPIO"       condition="FT32F0 STDDRIVER">
        <description>General-purpose I/O (GPIO) driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_GPIO
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/FT32F0xx_Driver/Src/ft32f0xx_gpio.c"/>
        </files>
      </component>
      <component Cgroup="FT32Driver"  Csub="I2C"        condition="FT32F0 STDDRIVER DMA">
        <description>Inter-integrated circuit (I2C) interface driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_I2C
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/FT32F0xx_Driver/Src/ft32f0xx_i2c.c"/>
        </files>
      </component>
      <component Cgroup="FT32Driver"  Csub="IWDG"       condition="FT32F0 STDDRIVER">
        <description>Independent watchdog (IWDG) driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_IWDG
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/FT32F0xx_Driver/Src/ft32f0xx_iwdg.c"/>
        </files>
      </component>
      <component Cgroup="FT32Driver"  Csub="MISC"       condition="FT32F0 STDDRIVER">
        <description>Independent NVIC (MISC) driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_MISC
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/FT32F0xx_Driver/Src/ft32f0xx_misc.c"/>
        </files>
      </component>
      <component Cgroup="FT32Driver"  Csub="OPA"        condition="FT32F0xxxB STDDRIVER">
        <description>Operational amplifier (OPA) driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_OPA
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/FT32F0xx_Driver/Src/ft32f0xx_opa.c"/>
        </files>
      </component>
      <component Cgroup="FT32Driver"  Csub="PWR"        condition="FT32F0 STDDRIVER">
        <description>Power controller (PWR) driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_PWR
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/FT32F0xx_Driver/Src/ft32f0xx_pwr.c"/>
        </files>
      </component>
      <component Cgroup="FT32Driver"  Csub="RCC"        condition="FT32F0 STDDRIVER">
        <description>Reset and clock control (RCC) driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_RCC
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/FT32F0xx_Driver/Src/ft32f0xx_rcc.c"/>
        </files>
      </component>
      <component Cgroup="FT32Driver"  Csub="RTC"        condition="FT32F0 STDDRIVER">
        <description>Real-time clock (RTC) driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_RTC
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/FT32F0xx_Driver/Src/ft32f0xx_rtc.c"/>
        </files>
      </component>
      <component Cgroup="FT32Driver"  Csub="SPI"        condition="FT32F0 STDDRIVER DMA">
        <description>Serial peripheral interface (SPI) driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_SPI
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/FT32F0xx_Driver/Src/ft32f0xx_spi.c"/>
        </files>
      </component>
      <component Cgroup="FT32Driver"  Csub="SYSCFG"     condition="FT32F0 STDDRIVER DMA">
        <description>System configuration (SYSCFG) driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_SYSCFG
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/FT32F0xx_Driver/Src/ft32f0xx_syscfg.c"/>
        </files>
      </component>
      <component Cgroup="FT32Driver"  Csub="TIM"        condition="FT32F0 STDDRIVER DMA">
        <description>Timers (TIM) driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_TIM
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/FT32F0xx_Driver/Src/ft32f0xx_tim.c"/>
        </files>
      </component>
      <component Cgroup="FT32Driver"  Csub="USART"      condition="FT32F0 STDDRIVER DMA">
        <description>Universal synchronous asynchronous receiver transmitter (USART) driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_USART
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/FT32F0xx_Driver/Src/ft32f0xx_usart.c"/>
        </files>
      </component>
      <component Cgroup="FT32Driver"  Csub="WWDG"       condition="FT32F0 STDDRIVER">
        <description>Window watchdog (WWDG) driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_WWDG
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/FT32F0xx_Driver/Src/ft32f0xx_wwdg.c"/>
        </files>
      </component>
      <!--component Cgroup="FT32Driver"  Csub="Touch"       condition="FT32F0xxxB STDDRIVER">
        <description>Touch driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_TOUCH
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/FT32F0xx_Driver/Lib/ft32f0xx_touch.lib"/>
          <file category="header" name="Drivers/FT32F0xx_Driver/Lib/ft32f0xx_touch.h"       attr="config"  version="1.0.0"/>
        </files>
      </component--> 
	  <component Cgroup="FT32Driver"  Csub="DIV"       condition="FT32F072xB STDDRIVER">
        <description>DIV driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_DIV
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/FT32F0xx_Driver/Src/ft32f0xx_div.c"/>
        </files>
      </component>
    </bundle>

    <!-- Starter-kit-072 Board Support -->
    <bundle Cbundle="Starter-kit-072" Cclass="Board Support" Cversion="1.0">
      <description>FMD FStarter-kit-072 Board</description>
      <doc></doc>
      <component Cgroup="LED" Capiversion="1.0" condition="FT32F072x8 CMSIS">
      <description>LED driver for FremontMicro Starter-kit-072 Board</description>
        <files>
          <file category="source" name="Boards/FMD/Starter-kit-072/Common/LED_FT32F072_Starter_kit.c"/>
        </files>
      </component>
