XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/FMD.FT32F0xx_DFP.pdsc
      <component Cgroup="Buttons" Capiversion="1.0.0" condition="FT32F072x8 CMSIS">
      <description>Button driver for FremontMicro Starter-kit-072 Board</description>
        <files>
          <file category="sourceC" name="Boards/FMD/Starter-kit-072/Common/Buttons_FT32F072_Starter_kit.c"/>
        </files>
      </component>
    </bundle>
	
  </components>  
  
  <boards>
     <board vendor="FMD" name="Starter-kit-072" revision="Ver 1.5">
		<description>FMD FT32F072 Development Board</description>
        <image small="Boards/FMD/Starter-kit-072/DOC/Starter-kit-072_small.jpg"
               large="Boards/FMD/Starter-kit-072/DOC/Starter-kit-072_large.jpg"/>
        <book category="overview"  name="Boards/FMD/Starter-kit-072/DOC/StarterKit Demo board introduction.pdf" title="Starter-kit-072 introduction"/>
		<book category="schematic" name="Boards/FMD/Starter-kit-072/DOC/StarterKit-V1.5.pdf"     title="Schematics"/>
		<mountedDevice deviceIndex="0"    Dvendor="FMD:169" Dname="FT32F072R8"/>
		<compatibleDevice deviceIndex="0" Dvendor="FMD:169" DsubFamily="FT32F072"/>
		<feature type="XTAL"   n="8000000"/>
		<feature type="PWR"    n="5"           name="USB Powered"/>
		<feature type="PWR"    n="2"  m="5.5"  name="External Supply"/>
		<feature type="USB"    n="1"           name="USB 2.0 Full Speed Device"/>
		<feature type="Button" n="3"           name="Reset, KEY1 and KEY2"/>
		<feature type="LED"    n="4"           name="LEDs directly connected to port pins"/>
		<debugInterface adapter="SW"/>
     </board>
  </boards>
  
  <examples>
        <example name="Starter-kit-072-Blinky" doc="readme.txt" folder="Boards/FMD/Starter-kit-072/Examples/FT32F0xx_SarterKitDemo_Suites/Projects/Blinky" version="1.0.1">
            <description>AStarter-kit-072  Blinky example</description>
            <board name="Starter-kit-072" vendor="FMD"/>
            <project>
                <environment name="uv" load="MDK-ARM/FT32F072x_StarterKit.uvprojx"/>
                <environment name="iar" load="EWARM/FT32F072x_StarterKit.eww"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>LED</keyword>
            </attributes>
        </example>
        <example name="ADC_BasicExample" doc="readme.txt" folder="Boards/FMD/Starter-kit-072/Examples/FT32F0xx_SarterKitDemo_Suites/Projects/ADC/ADC_BasicExample" version="1.0.1">
            <description>AStarter-kit-072  ADC_BasicExample example</description>
            <board name="Starter-kit-072" vendor="FMD"/>
            <project>
                <environment name="uv" load="MDK-ARM/FT32F072x_StarterKit.uvprojx"/>
                <environment name="iar" load="EWARM/FT32F072x_StarterKit.eww"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>ADC</keyword>
            </attributes>
        </example>
        <example name="ADC_DMA_INTERRUPT" doc="readme.txt" folder="Boards/FMD/Starter-kit-072/Examples/FT32F0xx_SarterKitDemo_Suites/Projects/ADC/ADC_DMA_INTERRUPT" version="1.0.1">
            <description>AStarter-kit-072  ADC_DMA_INTERRUPT example</description>
            <board name="Starter-kit-072" vendor="FMD"/>
            <project>
                <environment name="uv" load="MDK-ARM/FT32F072x_StarterKit.uvprojx"/>
                <environment name="iar" load="EWARM/FT32F072x_StarterKit.eww"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>ADC</keyword>
            </attributes>
        </example>
        <example name="ADC_InnerTempture" doc="readme.txt" folder="Boards/FMD/Starter-kit-072/Examples/FT32F0xx_SarterKitDemo_Suites/Projects/ADC/ADC_InnerTempture" version="1.0.1">
            <description>AStarter-kit-072  ADC_InnerTempture example</description>
            <board name="Starter-kit-072" vendor="FMD"/>
            <project>
                <environment name="uv" load="MDK-ARM/FT32F072x_StarterKit.uvprojx"/>
                <environment name="iar" load="EWARM/FT32F072x_StarterKit.eww"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>ADC</keyword>
            </attributes>
        </example>
		<example name="ADC_LowPower" doc="readme.txt" folder="Boards/FMD/Starter-kit-072/Examples/FT32F0xx_SarterKitDemo_Suites/Projects/ADC/ADC_LowPower" version="1.0.1">
            <description>AStarter-kit-072  ADC_LowPower example</description>
            <board name="Starter-kit-072" vendor="FMD"/>
            <project>
                <environment name="uv" load="MDK-ARM/FT32F072x_StarterKit.uvprojx"/>
                <environment name="iar" load="EWARM/FT32F072x_StarterKit.eww"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>ADC</keyword>
            </attributes>
        </example>
        <example name="ADC_SAMPLEANDHOLD" doc="readme.txt" folder="Boards/FMD/Starter-kit-072/Examples/FT32F0xx_SarterKitDemo_Suites/Projects/ADC/ADC_SAMPLEANDHOLD" version="1.0.1">
            <description>AStarter-kit-072  ADC_SAMPLEANDHOLD example</description>
            <board name="Starter-kit-072" vendor="FMD"/>
            <project>
                <environment name="uv" load="MDK-ARM/FT32F072x_StarterKit.uvprojx"/>
                <environment name="iar" load="EWARM/FT32F072x_StarterKit.eww"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>ADC</keyword>
            </attributes>
        </example>
		<example name="ADC_SINGLE_CHAN" doc="readme.txt" folder="Boards/FMD/Starter-kit-072/Examples/FT32F0xx_SarterKitDemo_Suites/Projects/ADC/ADC_SINGLE_CHAN" version="1.0.1">
            <description>AStarter-kit-072  ADC_SINGLE_CHAN example</description>
            <board name="Starter-kit-072" vendor="FMD"/>
            <project>
                <environment name="uv" load="MDK-ARM/FT32F072x_StarterKit.uvprojx"/>
                <environment name="iar" load="EWARM/FT32F072x_StarterKit.eww"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>ADC</keyword>
            </attributes>
        </example>
		<example name="ADC_VDDA_Vrefint" doc="readme.txt" folder="Boards/FMD/Starter-kit-072/Examples/FT32F0xx_SarterKitDemo_Suites/Projects/ADC/ADC_VDDA_Vrefint" version="1.0.1">
            <description>AStarter-kit-072  ADC_VDDA_Vrefint example</description>
            <board name="Starter-kit-072" vendor="FMD"/>
            <project>
                <environment name="uv" load="MDK-ARM/FT32F072x_StarterKit.uvprojx"/>
                <environment name="iar" load="EWARM/FT32F072x_StarterKit.eww"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>ADC</keyword>
            </attributes>
        </example>
		<example name="DMA_INTERRUPT_MultiChann_ADC" doc="readme.txt" folder="Boards/FMD/Starter-kit-072/Examples/FT32F0xx_SarterKitDemo_Suites/Projects/ADC/DMA_INTERRUPT_MultiChann_ADC" version="1.0.1">
            <description>AStarter-kit-072  DMA_INTERRUPT_MultiChann_ADC example</description>
            <board name="Starter-kit-072" vendor="FMD"/>
            <project>
                <environment name="uv" load="MDK-ARM/FT32F072x_StarterKit.uvprojx"/>
                <environment name="iar" load="EWARM/FT32F072x_StarterKit.eww"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>ADC</keyword>
            </attributes>
        </example>
		<example name="BSP_COMP" doc="readme.txt" folder="Boards/FMD/Starter-kit-072/Examples/FT32F0xx_SarterKitDemo_Suites/Projects/COMP/BSP_COMP" version="1.0.1">
            <description>AStarter-kit-072  BSP_COMP example</description>
            <board name="Starter-kit-072" vendor="FMD"/>
            <project>
                <environment name="uv" load="MDK-ARM/FT32F072x_StarterKit.uvprojx"/>
                <environment name="iar" load="EWARM/FT32F072x_StarterKit.eww"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>COMP</keyword>
            </attributes>
        </example>
		<example name="CRC" doc="readme.txt" folder="Boards/FMD/Starter-kit-072/Examples/FT32F0xx_SarterKitDemo_Suites/Projects/CRC" version="1.0.1">
            <description>AStarter-kit-072  CRC example</description>
            <board name="Starter-kit-072" vendor="FMD"/>
            <project>
                <environment name="uv" load="MDK-ARM/FT32F072x_StarterKit.uvprojx"/>
                <environment name="iar" load="EWARM/FT32F072x_StarterKit.eww"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>CRC</keyword>
            </attributes>
        </example>
		<example name="DAC" doc="readme.txt" folder="Boards/FMD/Starter-kit-072/Examples/FT32F0xx_SarterKitDemo_Suites/Projects/DAC" version="1.0.1">
            <description>AStarter-kit-072  DAC example</description>
            <board name="Starter-kit-072" vendor="FMD"/>
            <project>
                <environment name="uv" load="MDK-ARM/FT32F072x_StarterKit.uvprojx"/>
                <environment name="iar" load="EWARM/FT32F072x_StarterKit.eww"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>DAC</keyword>
            </attributes>
        </example>
		<example name="DMA_ADCTransfer" doc="readme.txt" folder="Boards/FMD/Starter-kit-072/Examples/FT32F0xx_SarterKitDemo_Suites/Projects/DMA/DMA_ADCTransfer" version="1.0.1">
            <description>AStarter-kit-072  DMA_ADCTransfer example</description>
            <board name="Starter-kit-072" vendor="FMD"/>
            <project>
                <environment name="uv" load="MDK-ARM/FT32F072x_StarterKit.uvprojx"/>
                <environment name="iar" load="EWARM/FT32F072x_StarterKit.eww"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>DMA</keyword>
            </attributes>
        </example>
		<example name="DMA_FLASHRAMTransfer_Program" doc="readme.txt" folder="Boards/FMD/Starter-kit-072/Examples/FT32F0xx_SarterKitDemo_Suites/Projects/DMA/DMA_FLASHRAMTransfer_Program" version="1.0.1">
            <description>AStarter-kit-072  DMA_FLASHRAMTransfer_Program example</description>
            <board name="Starter-kit-072" vendor="FMD"/>
            <project>
                <environment name="uv" load="MDK-ARM/FT32F072x_StarterKit.uvprojx"/>
                <environment name="iar" load="EWARM/FT32F072x_StarterKit.eww"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>DMA</keyword>
            </attributes>
        </example>
		<example name="DMA_USARTTransfer_Project" doc="readme.txt" folder="Boards/FMD/Starter-kit-072/Examples/FT32F0xx_SarterKitDemo_Suites/Projects/DMA/DMA_USARTTransfer_Project" version="1.0.1">
            <description>AStarter-kit-072  DMA_USARTTransfer_Project example</description>
            <board name="Starter-kit-072" vendor="FMD"/>
            <project>
                <environment name="uv" load="MDK-ARM/FT32F072x_StarterKit.uvprojx"/>
                <environment name="iar" load="EWARM/FT32F072x_StarterKit.eww"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>DMA</keyword>
            </attributes>
        </example>
		<example name="DMA_SPI_Master" doc="readme.txt" folder="Boards/FMD/Starter-kit-072/Examples/FT32F0xx_SarterKitDemo_Suites/Projects/DMA/DMA_SPI_Master" version="1.0.0">
            <description>AStarter-kit-072  DMA_SPI_Master example</description>
            <board name="Starter-kit-072" vendor="FMD"/>
            <project>
                <environment name="uv" load="MDK-ARM/FT32F072x_StarterKit.uvprojx"/>
                <environment name="iar" load="EWARM/FT32F072x_StarterKit.eww"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>DMA</keyword>
            </attributes>
        </example>
		<example name="EXTI" doc="readme.txt" folder="Boards/FMD/Starter-kit-072/Examples/FT32F0xx_SarterKitDemo_Suites/Projects/EXTI" version="1.0.1">
            <description>AStarter-kit-072  EXTI example</description>
            <board name="Starter-kit-072" vendor="FMD"/>
            <project>
                <environment name="uv" load="MDK-ARM/FT32F072x_StarterKit.uvprojx"/>
                <environment name="iar" load="EWARM/FT32F072x_StarterKit.eww"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>EXTI</keyword>
            </attributes>
        </example>
		<example name="Flash_WriteProtection" doc="readme.txt" folder="Boards/FMD/Starter-kit-072/Examples/FT32F0xx_SarterKitDemo_Suites/Projects/FLASH/Flash_WriteProtection_Project" version="1.0.1">
            <description>AStarter-kit-072  Flash_WriteProtection example</description>
            <board name="Starter-kit-072" vendor="FMD"/>
            <project>
                <environment name="uv" load="MDK-ARM/FT32F072x_StarterKit.uvprojx"/>
                <environment name="iar" load="EWARM/FT32F072x_StarterKit.eww"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>FLASH</keyword>
            </attributes>
        </example>
		<example name="FlashProgram" doc="readme.txt" folder="Boards/FMD/Starter-kit-072/Examples/FT32F0xx_SarterKitDemo_Suites/Projects/FLASH/FlashProgram_Project" version="1.0.1">
            <description>AStarter-kit-072  FlashProgram example</description>
            <board name="Starter-kit-072" vendor="FMD"/>
            <project>
                <environment name="uv" load="MDK-ARM/FT32F072x_StarterKit.uvprojx"/>
                <environment name="iar" load="EWARM/FT32F072x_StarterKit.eww"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>FLASH</keyword>
            </attributes>
        </example>
		<example name="GPIO_IOToggle" doc="readme.txt" folder="Boards/FMD/Starter-kit-072/Examples/FT32F0xx_SarterKitDemo_Suites/Projects/GPIO_IOToggle" version="1.0.1">
            <description>AStarter-kit-072  GPIO_IOToggle example</description>
            <board name="Starter-kit-072" vendor="FMD"/>
            <project>
                <environment name="uv" load="MDK-ARM/FT32F072x_StarterKit.uvprojx"/>
                <environment name="iar" load="EWARM/FT32F072x_StarterKit.eww"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>GPIO</keyword>
            </attributes>
        </example>
		<example name="I2C_MasterSlave" doc="readme.txt" folder="Boards/FMD/Starter-kit-072/Examples/FT32F0xx_SarterKitDemo_Suites/Projects/I2C/I2C_MasterSlave" version="1.0.1">
            <description>AStarter-kit-072  I2C_MasterSlave example</description>
            <board name="Starter-kit-072" vendor="FMD"/>
            <project>
                <environment name="uv" load="MDK-ARM/FT32F072x_StarterKit.uvprojx"/>
                <environment name="iar" load="EWARM/FT32F072x_StarterKit.eww"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>I2C</keyword>
            </attributes>
        </example>
		<example name="I2C_EEPROM" doc="readme.txt" folder="Boards/FMD/Starter-kit-072/Examples/FT32F0xx_SarterKitDemo_Suites/Projects/I2C/I2C_EEPROM" version="1.0.1">
            <description>AStarter-kit-072  I2C_EEPROM example</description>
            <board name="Starter-kit-072" vendor="FMD"/>
            <project>
                <environment name="uv" load="MDK-ARM/FT32F072x_StarterKit.uvprojx"/>
                <environment name="iar" load="EWARM/FT32F072x_StarterKit.eww"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>I2C</keyword>
            </attributes>
        </example>
		<example name="I2C_OLED" doc="readme.txt" folder="Boards/FMD/Starter-kit-072/Examples/FT32F0xx_SarterKitDemo_Suites/Projects/I2C/I2C_OLED" version="1.0.1">
            <description>AStarter-kit-072  I2C_OLED example</description>
            <board name="Starter-kit-072" vendor="FMD"/>
            <project>
                <environment name="uv" load="MDK-ARM/FT32F072x_StarterKit.uvprojx"/>
                <environment name="iar" load="EWARM/FT32F072x_StarterKit.eww"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>I2C</keyword>
            </attributes>
        </example>
		<example name="I2C_Master" doc="readme.txt" folder="Boards/FMD/Starter-kit-072/Examples/FT32F0xx_SarterKitDemo_Suites/Projects/I2C/I2C_Master" version="1.0.0">
            <description>AStarter-kit-072  I2C_Master example</description>
            <board name="Starter-kit-072" vendor="FMD"/>
            <project>
                <environment name="uv" load="MDK-ARM/FT32F072x_StarterKit.uvprojx"/>
                <environment name="iar" load="EWARM/FT32F072x_StarterKit.eww"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>I2C</keyword>
            </attributes>
        </example>
		<example name="I2C_Slave" doc="readme.txt" folder="Boards/FMD/Starter-kit-072/Examples/FT32F0xx_SarterKitDemo_Suites/Projects/I2C/I2C_Slave" version="1.0.0">
            <description>AStarter-kit-072  I2C_Slave example</description>
            <board name="Starter-kit-072" vendor="FMD"/>
            <project>
                <environment name="uv" load="MDK-ARM/FT32F072x_StarterKit.uvprojx"/>
                <environment name="iar" load="EWARM/FT32F072x_StarterKit.eww"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
