XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/FMD.FT32F0xx_DFP.pdsc
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>I2C</keyword>
            </attributes>
        </example>
		<example name="IWDG_RESET" doc="readme.txt" folder="Boards/FMD/Starter-kit-072/Examples/FT32F0xx_SarterKitDemo_Suites/Projects/IWDG/IWDG_RESET" version="1.0.1">
            <description>AStarter-kit-072  IWDG_RESET example</description>
            <board name="Starter-kit-072" vendor="FMD"/>
            <project>
                <environment name="uv" load="MDK-ARM/FT32F072x_StarterKit.uvprojx"/>
                <environment name="iar" load="EWARM/FT32F072x_StarterKit.eww"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>IWDG</keyword>
            </attributes>
        </example>
		<example name="IWDG_WindowMode" doc="readme.txt" folder="Boards/FMD/Starter-kit-072/Examples/FT32F0xx_SarterKitDemo_Suites/Projects/IWDG/IWDG_WindowMode" version="1.0.1">
            <description>AStarter-kit-072  IWDG_WindowMode example</description>
            <board name="Starter-kit-072" vendor="FMD"/>
            <project>
                <environment name="uv" load="MDK-ARM/FT32F072x_StarterKit.uvprojx"/>
                <environment name="iar" load="EWARM/FT32F072x_StarterKit.eww"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>IWDG</keyword>
            </attributes>
        </example>
		<example name="LED" doc="readme.txt" folder="Boards/FMD/Starter-kit-072/Examples/FT32F0xx_SarterKitDemo_Suites/Projects/LED" version="1.0.1">
            <description>AStarter-kit-072  LED example</description>
            <board name="Starter-kit-072" vendor="FMD"/>
            <project>
                <environment name="uv" load="MDK-ARM/FT32F072x_StarterKit.uvprojx"/>
                <environment name="iar" load="EWARM/FT32F072x_StarterKit.eww"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>LED</keyword>
            </attributes>
        </example>
		<example name="NVIC_WFI_Mode" doc="readme.txt" folder="Boards/FMD/Starter-kit-072/Examples/FT32F0xx_SarterKitDemo_Suites/Projects/NVIC_WFI_Mode" version="1.0.1">
            <description>AStarter-kit-072  NVIC_WFI_Mode example</description>
            <board name="Starter-kit-072" vendor="FMD"/>
            <project>
                <environment name="uv" load="MDK-ARM/FT32F072x_StarterKit.uvprojx"/>
                <environment name="iar" load="EWARM/FT32F072x_StarterKit.eww"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>WFI</keyword>
            </attributes>
        </example>
		<example name="BSP_OPA" doc="readme.txt" folder="Boards/FMD/Starter-kit-072/Examples/FT32F0xx_SarterKitDemo_Suites/Projects/OPA/BSP_OPA" version="1.0.1">
            <description>AStarter-kit-072  BSP_OPA example</description>
            <board name="Starter-kit-072" vendor="FMD"/>
            <project>
                <environment name="uv" load="MDK-ARM/FT32F072x_StarterKit.uvprojx"/>
                <environment name="iar" load="EWARM/FT32F072x_StarterKit.eww"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>OPA</keyword>
            </attributes>
        </example>
		<example name="PWR_Standby_wakup1" doc="readme.txt" folder="Boards/FMD/Starter-kit-072/Examples/FT32F0xx_SarterKitDemo_Suites/Projects/PWR/PWR_Standby_wakup1" version="1.0.1">
            <description>AStarter-kit-072  PWR_Standby example</description>
            <board name="Starter-kit-072" vendor="FMD"/>
            <project>
                <environment name="uv" load="MDK-ARM/FT32F072x_StarterKit.uvprojx"/>
                <environment name="iar" load="EWARM/FT32F072x_StarterKit.eww"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>PWR</keyword>
            </attributes>
        </example>
		<example name="PWR_Stop" doc="readme.txt" folder="Boards/FMD/Starter-kit-072/Examples/FT32F0xx_SarterKitDemo_Suites/Projects/PWR/PWR_Stop" version="1.0.1">
            <description>AStarter-kit-072  PWR_Stop example</description>
            <board name="Starter-kit-072" vendor="FMD"/>
            <project>
                <environment name="uv" load="MDK-ARM/FT32F072x_StarterKit.uvprojx"/>
                <environment name="iar" load="EWARM/FT32F072x_StarterKit.eww"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>PWR</keyword>
            </attributes>
        </example>
		<example name="PWR_Stop_WAKUP_COMP" doc="readme.txt" folder="Boards/FMD/Starter-kit-072/Examples/FT32F0xx_SarterKitDemo_Suites/Projects/PWR/PWR_Stop_WAKUP_COMP" version="1.0.1">
            <description>AStarter-kit-072  PWR_Stop_WAKUP_COMP example</description>
            <board name="Starter-kit-072" vendor="FMD"/>
            <project>
                <environment name="uv" load="MDK-ARM/FT32F072x_StarterKit.uvprojx"/>
                <environment name="iar" load="EWARM/FT32F072x_StarterKit.eww"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>PWR</keyword>
            </attributes>
        </example>
		<example name="PWR_Stop_WAKUP_EX_INTERRUPT" doc="readme.txt" folder="Boards/FMD/Starter-kit-072/Examples/FT32F0xx_SarterKitDemo_Suites/Projects/PWR/PWR_Stop_WAKUP_EX_INTERRUPT" version="1.0.1">
            <description>AStarter-kit-072  PWR_Stop_WAKUP_EX_INTERRUPT example</description>
            <board name="Starter-kit-072" vendor="FMD"/>
            <project>
                <environment name="uv" load="MDK-ARM/FT32F072x_StarterKit.uvprojx"/>
                <environment name="iar" load="EWARM/FT32F072x_StarterKit.eww"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>PWR</keyword>
            </attributes>
        </example>
		<example name="PVD" doc="readme.txt" folder="Boards/FMD/Starter-kit-072/Examples/FT32F0xx_SarterKitDemo_Suites/Projects/PWR/PVD" version="1.0.0">
            <description>AStarter-kit-072  PVD example</description>
            <board name="Starter-kit-072" vendor="FMD"/>
            <project>
                <environment name="uv" load="MDK-ARM/FT32F072x_StarterKit.uvprojx"/>
                <environment name="iar" load="EWARM/FT32F072x_StarterKit.eww"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>PWR</keyword>
            </attributes>
        </example>
		<example name="PWR_Standby_RTC" doc="readme.txt" folder="Boards/FMD/Starter-kit-072/Examples/FT32F0xx_SarterKitDemo_Suites/Projects/PWR/PWR_Standby_RTC" version="1.0.0">
            <description>AStarter-kit-072  PWR_Standby_RTC example</description>
            <board name="Starter-kit-072" vendor="FMD"/>
            <project>
                <environment name="uv" load="MDK-ARM/FT32F072x_StarterKit.uvprojx"/>
                <environment name="iar" load="EWARM/FT32F072x_StarterKit.eww"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>PWR</keyword>
            </attributes>
        </example>
		<example name="PWR_Stop_MIN_SYS" doc="readme.txt" folder="Boards/FMD/Starter-kit-072/Examples/FT32F0xx_SarterKitDemo_Suites/Projects/PWR/PWR_Stop_MIN_SYS" version="1.0.0">
            <description>AStarter-kit-072  PWR_Stop_MIN_SYS example</description>
            <board name="Starter-kit-072" vendor="FMD"/>
            <project>
                <environment name="uv" load="MDK-ARM/FT32F072x_StarterKit.uvprojx"/>
                <environment name="iar" load="EWARM/FT32F072x_StarterKit.eww"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>PWR</keyword>
            </attributes>
        </example>
		<example name="RTC ALARM STOP WAKE" doc="readme.txt" folder="Boards/FMD/Starter-kit-072/Examples/FT32F0xx_SarterKitDemo_Suites/Projects/RTC/RTC ALARM STOP WAKE" version="1.0.1">
            <description>AStarter-kit-072  RTC ALARM STOP WAKE example</description>
            <board name="Starter-kit-072" vendor="FMD"/>
            <project>
                <environment name="uv" load="MDK-ARM/FT32F072x_StarterKit.uvprojx"/>
                <environment name="iar" load="EWARM/FT32F072x_StarterKit.eww"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>RTC</keyword>
            </attributes>
        </example>
		<example name="SPI_EEPROM" doc="readme.txt" folder="Boards/FMD/Starter-kit-072/Examples/FT32F0xx_SarterKitDemo_Suites/Projects/SPI/SPI_EEPROM" version="1.0.1">
            <description>AStarter-kit-072  SPI_EEPROM example</description>
            <board name="Starter-kit-072" vendor="FMD"/>
            <project>
                <environment name="uv" load="MDK-ARM/FT32F072x_StarterKit.uvprojx"/>
                <environment name="iar" load="EWARM/FT32F072x_StarterKit.eww"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>SPI</keyword>
            </attributes>
        </example>
		<example name="SysTick" doc="readme.txt" folder="Boards/FMD/Starter-kit-072/Examples/FT32F0xx_SarterKitDemo_Suites/Projects/SysTick" version="1.0.1">
            <description>AStarter-kit-072  SysTick example</description>
            <board name="Starter-kit-072" vendor="FMD"/>
            <project>
                <environment name="uv" load="MDK-ARM/FT32F072x_StarterKit.uvprojx"/>
                <environment name="iar" load="EWARM/FT32F072x_StarterKit.eww"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>SysTick</keyword>
            </attributes>
        </example>
		<example name="TIM_6Steps" doc="readme.txt" folder="Boards/FMD/Starter-kit-072/Examples/FT32F0xx_SarterKitDemo_Suites/Projects/TIM/TIM_6Steps" version="1.0.1">
            <description>AStarter-kit-072  TIM_6Steps example</description>
            <board name="Starter-kit-072" vendor="FMD"/>
            <project>
                <environment name="uv" load="MDK-ARM/FT32F072x_StarterKit.uvprojx"/>
                <environment name="iar" load="EWARM/FT32F072x_StarterKit.eww"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>TIM</keyword>
            </attributes>
        </example>
		<example name="TIM_7PWMOutputs" doc="readme.txt" folder="Boards/FMD/Starter-kit-072/Examples/FT32F0xx_SarterKitDemo_Suites/Projects/TIM/TIM_7PWMOutputs" version="1.0.1">
            <description>AStarter-kit-072  TIM_7PWMOutputs example</description>
            <board name="Starter-kit-072" vendor="FMD"/>
            <project>
                <environment name="uv" load="MDK-ARM/FT32F072x_StarterKit.uvprojx"/>
                <environment name="iar" load="EWARM/FT32F072x_StarterKit.eww"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>TIM</keyword>
            </attributes>
        </example>
		<example name="TIM_CAPTURE" doc="readme.txt" folder="Boards/FMD/Starter-kit-072/Examples/FT32F0xx_SarterKitDemo_Suites/Projects/TIM/TIM_CAPTURE" version="1.0.1">
            <description>AStarter-kit-072  TIM_CAPTURE example</description>
            <board name="Starter-kit-072" vendor="FMD"/>
            <project>
                <environment name="uv" load="MDK-ARM/FT32F072x_StarterKit.uvprojx"/>
                <environment name="iar" load="EWARM/FT32F072x_StarterKit.eww"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>TIM</keyword>
            </attributes>
        </example>
		<example name="TIM_DELAY" doc="readme.txt" folder="Boards/FMD/Starter-kit-072/Examples/FT32F0xx_SarterKitDemo_Suites/Projects/TIM/TIM_DELAY" version="1.0.1">
            <description>AStarter-kit-072  TIM_DELAY example</description>
            <board name="Starter-kit-072" vendor="FMD"/>
            <project>
                <environment name="uv" load="MDK-ARM/FT32F072x_StarterKit.uvprojx"/>
                <environment name="iar" load="EWARM/FT32F072x_StarterKit.eww"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>TIM</keyword>
            </attributes>
        </example>
		<example name="TIM_DMA_PULS_CNT" doc="readme.txt" folder="Boards/FMD/Starter-kit-072/Examples/FT32F0xx_SarterKitDemo_Suites/Projects/TIM/TIM_DMA_PULS_CNT" version="1.0.1">
            <description>AStarter-kit-072  TIM_DMA_PULS_CNT example</description>
            <board name="Starter-kit-072" vendor="FMD"/>
            <project>
                <environment name="uv" load="MDK-ARM/FT32F072x_StarterKit.uvprojx"/>
                <environment name="iar" load="EWARM/FT32F072x_StarterKit.eww"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>TIM</keyword>
            </attributes>
        </example>
		<example name="TIM_IR" doc="readme.txt" folder="Boards/FMD/Starter-kit-072/Examples/FT32F0xx_SarterKitDemo_Suites/Projects/TIM/TIM_IR" version="1.0.1">
            <description>AStarter-kit-072  TIM_IR example</description>
            <board name="Starter-kit-072" vendor="FMD"/>
            <project>
                <environment name="uv" load="MDK-ARM/FT32F072x_StarterKit.uvprojx"/>
                <environment name="iar" load="EWARM/FT32F072x_StarterKit.eww"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>TIM</keyword>
            </attributes>
        </example>
		<example name="CNT_FOR_INPUT_PULSE" doc="readme.txt" folder="Boards/FMD/Starter-kit-072/Examples/FT32F0xx_SarterKitDemo_Suites/Projects/TIM/CNT_FOR_INPUT_PULSE" version="1.0.0">
            <description>AStarter-kit-072  CNT_FOR_INPUT_PULSE example</description>
            <board name="Starter-kit-072" vendor="FMD"/>
            <project>
                <environment name="uv" load="MDK-ARM/FT32F072x_StarterKit.uvprojx"/>
                <environment name="iar" load="EWARM/FT32F072x_StarterKit.eww"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>TIM</keyword>
            </attributes>
        </example>
		<example name="USART_AutoBaudRate" doc="readme.txt" folder="Boards/FMD/Starter-kit-072/Examples/FT32F0xx_SarterKitDemo_Suites/Projects/USART/USART_AutoBaudRate_Project" version="1.0.1">
            <description>AStarter-kit-072  USART_AutoBaudRate example</description>
            <board name="Starter-kit-072" vendor="FMD"/>
            <project>
                <environment name="uv" load="MDK-ARM/FT32F072x_StarterKit.uvprojx"/>
                <environment name="iar" load="EWARM/FT32F072x_StarterKit.eww"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>TIM</keyword>
            </attributes>
        </example>
		<example name="USART_Printf" doc="readme.txt" folder="Boards/FMD/Starter-kit-072/Examples/FT32F0xx_SarterKitDemo_Suites/Projects/USART/USART_Printf" version="1.0.1">
            <description>AStarter-kit-072  USART_Printf example</description>
            <board name="Starter-kit-072" vendor="FMD"/>
            <project>
                <environment name="uv" load="MDK-ARM/FT32F072x_StarterKit.uvprojx"/>
                <environment name="iar" load="EWARM/FT32F072x_StarterKit.eww"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>USART</keyword>
            </attributes>
        </example>
		<example name="USART" doc="readme.txt" folder="Boards/FMD/Starter-kit-072/Examples/FT32F0xx_SarterKitDemo_Suites/Projects/USART/USART_Project" version="1.0.1">
            <description>AStarter-kit-072  USART example</description>
            <board name="Starter-kit-072" vendor="FMD"/>
            <project>
                <environment name="uv" load="MDK-ARM/FT32F072x_StarterKit.uvprojx"/>
                <environment name="iar" load="EWARM/FT32F072x_StarterKit.eww"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>USART</keyword>
            </attributes>
        </example>
		<example name="USART_HalfDuplex" doc="readme.txt" folder="Boards/FMD/Starter-kit-072/Examples/FT32F0xx_SarterKitDemo_Suites/Projects/USART/USART_HalfDuplex" version="1.0.0">
            <description>AStarter-kit-072  USART_HalfDuplex example</description>
            <board name="Starter-kit-072" vendor="FMD"/>
            <project>
                <environment name="uv" load="MDK-ARM/FT32F072x_StarterKit.uvprojx"/>
                <environment name="iar" load="EWARM/FT32F072x_StarterKit.eww"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>USART</keyword>
            </attributes>
        </example>
		<example name="FT32F072X8_USB_Printer" doc="readme.txt" folder="Boards/FMD/Starter-kit-072/Examples/FT32F0xx_SarterKitDemo_Suites/Projects/USB/FT32F072X8_USB_Printer" version="1.0.1">
            <description>AStarter-kit-072  USB_Printer example</description>
            <board name="Starter-kit-072" vendor="FMD"/>
            <project>
