XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/FMD.FT32F0xx_DFP.pdsc
                <environment name="uv" load="MDK-ARM/FT32F072x_StarterKit.uvprojx"/>
                <environment name="iar" load="EWARM/FT32F072x_StarterKit.eww"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>USB</keyword>
            </attributes>
        </example>
		<example name="USB_Audio" doc="readme.txt" folder="Boards/FMD/Starter-kit-072/Examples/FT32F0xx_SarterKitDemo_Suites/Projects/USB/USB_Audio" version="1.0.1">
            <description>AStarter-kit-072  USB_Audio example</description>
            <board name="Starter-kit-072" vendor="FMD"/>
            <project>
                <environment name="uv" load="MDK-ARM/FT32F072x_StarterKit.uvprojx"/>
                <environment name="iar" load="EWARM/FT32F072x_StarterKit.eww"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>USB</keyword>
            </attributes>
        </example>		
		<example name="USB_Audio_Microphone" doc="readme.txt" folder="Boards/FMD/Starter-kit-072/Examples/FT32F0xx_SarterKitDemo_Suites/Projects/USB/USB_Audio_Microphone" version="1.0.1">
            <description>AStarter-kit-072  USB_Audio_Microphone example</description>
            <board name="Starter-kit-072" vendor="FMD"/>
            <project>
                <environment name="uv" load="MDK-ARM/FT32F072x_StarterKit.uvprojx"/>
                <environment name="iar" load="EWARM/FT32F072x_StarterKit.eww"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>USB</keyword>
            </attributes>
        </example>	
		<example name="USB_HID_Keyboard" doc="readme.txt" folder="Boards/FMD/Starter-kit-072/Examples/FT32F0xx_SarterKitDemo_Suites/Projects/USB/USB_HID_Keyboard" version="1.0.1">
            <description>AStarter-kit-072  USB_HID_Keyboard example</description>
            <board name="Starter-kit-072" vendor="FMD"/>
            <project>
                <environment name="uv" load="MDK-ARM/FT32F072x_StarterKit.uvprojx"/>
                <environment name="iar" load="EWARM/FT32F072x_StarterKit.eww"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>USB</keyword>
            </attributes>
        </example>	
		<example name="USB_HID_Keyboard-with-IapUpgrade" doc="readme.txt" folder="Boards/FMD/Starter-kit-072/Examples/FT32F0xx_SarterKitDemo_Suites/Projects/USB/USB_HID_Keyboard-with-IapUpgrade" version="1.0.1">
            <description>AStarter-kit-072  USB_HID_Keyboard-with-IapUpgrade example</description>
            <board name="Starter-kit-072" vendor="FMD"/>
            <project>
                <environment name="uv" load="MDK-ARM/FT32F072x_StarterKit.uvprojx"/>
                <environment name="iar" load="EWARM/FT32F072x_StarterKit.eww"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>USB</keyword>
            </attributes>
        </example>
		<example name="USB_HID_KeyboardWithMouse" doc="readme.txt" folder="Boards/FMD/Starter-kit-072/Examples/FT32F0xx_SarterKitDemo_Suites/Projects/USB/USB_HID_KeyboardWithMouse" version="1.0.1">
            <description>AStarter-kit-072  USB_HID_KeyboardWithMouse example</description>
            <board name="Starter-kit-072" vendor="FMD"/>
            <project>
                <environment name="uv" load="MDK-ARM/FT32F072x_StarterKit.uvprojx"/>
                <environment name="iar" load="EWARM/FT32F072x_StarterKit.eww"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>USB</keyword>
            </attributes>
        </example>
		<example name="USB_HID_Mouse" doc="readme.txt" folder="Boards/FMD/Starter-kit-072/Examples/FT32F0xx_SarterKitDemo_Suites/Projects/USB/USB_HID_Mouse" version="1.0.1">
            <description>AStarter-kit-072  USB_HID_Mouse example</description>
            <board name="Starter-kit-072" vendor="FMD"/>
            <project>
                <environment name="uv" load="MDK-ARM/FT32F072x_StarterKit.uvprojx"/>
                <environment name="iar" load="EWARM/FT32F072x_StarterKit.eww"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>USB</keyword>
            </attributes>
        </example>
		<example name="USB_HID_VCP" doc="readme.txt" folder="Boards/FMD/Starter-kit-072/Examples/FT32F0xx_SarterKitDemo_Suites/Projects/USB/USB_HID_VCP" version="1.0.1">
            <description>AStarter-kit-072  USB_HID_VCP example</description>
            <board name="Starter-kit-072" vendor="FMD"/>
            <project>
                <environment name="uv" load="MDK-ARM/FT32F072x_StarterKit.uvprojx"/>
                <environment name="iar" load="EWARM/FT32F072x_StarterKit.eww"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>USB</keyword>
            </attributes>
        </example>
		<example name="USB_MSC" doc="readme.txt" folder="Boards/FMD/Starter-kit-072/Examples/FT32F0xx_SarterKitDemo_Suites/Projects/USB/USB_MSC" version="1.0.1">
            <description>AStarter-kit-072  USB_MSC example</description>
            <board name="Starter-kit-072" vendor="FMD"/>
            <project>
                <environment name="uv" load="MDK-ARM/FT32F072x_StarterKit.uvprojx"/>
                <environment name="iar" load="EWARM/FT32F072x_StarterKit.eww"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>USB</keyword>
            </attributes>
        </example>
		<example name="USB_Smart_Card" doc="readme.txt" folder="Boards/FMD/Starter-kit-072/Examples/FT32F0xx_SarterKitDemo_Suites/Projects/USB/USB_Smart_Card" version="1.0.1">
            <description>AStarter-kit-072  USB_Smart_Card example</description>
            <board name="Starter-kit-072" vendor="FMD"/>
            <project>
                <environment name="uv" load="MDK-ARM/FT32F072x_StarterKit.uvprojx"/>
                <environment name="iar" load="EWARM/FT32F072x_StarterKit.eww"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>USB</keyword>
            </attributes>
        </example>
    </examples>
	
</package>
